"""

Домашнее задание №1

Условный оператор: Сравнение строк

* Написать функцию, которая принимает на вход две строки
* Проверить, является ли то, что передано функции, строками. 
  Если нет - вернуть 0
* Если строки одинаковые, вернуть 1
* Если строки разные и первая длиннее, вернуть 2
* Если строки разные и вторая строка 'learn', возвращает 3
* Вызвать функцию несколько раз, передавая ей разные праметры 
  и выводя на экран результаты

"""

def main(string1, string2):
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """
    answer = None    
    if type(string1) != str or type(string2) != str: 
      answer = 0
    elif string1 == string2:
      answer = 1
    elif string1 != string2 and string2 =="learn":
      answer = 3
    elif len(string1) > len(string2):
      answer = 2
    return answer
    

if __name__ == "__main__":
#    main() Изначально делал через input, но в субботу на созвоне сказали что это неверно - исправил и добавил примеров работы функции
    print(main(100, 2))
    print(main(100, "3"))
    print(main("Привет", "Привет"))
    print(main("шесть", "пять"))
    print(main("сто", "десять"))
    print(main("Python", "learn"))